package com.haier.ai.bluetoothspeaker.bean.news;

import java.util.List;

/**
 * Created by qx on 17-2-15.
 */

public class ResponseNews {

    /**
     * retCode : 00000
     * retInfo : 操作成功
     * sn : 20170219103628864000143653
     * data : {"domain":"news","news":[{"title":"小伙结婚能赚50万?父亲:要不今年不工作找对象吧","category":"头条","author_name":"杭州交通918","date":"2017-02-19 09:50","url":"http://mini.eastday.com/mobile/170219095010612.html","content":"说起拆迁，总是能让不少人兴奋。得知要拆迁，有一些家庭会通过闪婚，短时间内让家庭再添一员，以获得更多的补偿。萧山一小伙在论坛发帖说：老爸说，要是今年娶个老婆，相当于直接赚了50万。村里下半年拆迁的可能性极大，老爸说：\u201c你要是没对象赶紧找，光搬家人头费补贴就十几万，还能多分安置房，不要房换现金是50万。要不今年不用工作了，你的任务就是找对象，找到了就是赚钱了，少奋斗好几年！ \u201d想想确实是这么个道理，但可惜啊，人生不如意之事太多，虽然年纪不小了，相亲了几次也就敷衍一下，都没成。一个人多自由啊，早睡早起，吃好喝好，无牵无挂。弱弱的问一句，现在速战速决，还是等以后再解决？毕竟穷人家的孩子，可能会听父母多一点吧，这就是现实。虽然这也不是什么新鲜事，只不过自己遇到了这种事，才知道选择其实不容易。这年头赚钱不容易，找个心爱的人更不容易，只能说不强求，两全其美的事万一真发生了也是开心的。我相信，还有很多跟我一样处境的小伙伴，一旦选择了，就不要再遗憾。在该论坛里随便搜搜，类似情况的帖子很多，甚至有网友为了补偿结婚离婚了三次。但如愿得了人头费、安置房之后，婚姻会幸福吗？》》》拆迁结婚到底该不该？有人说：这种婚姻像买卖\u201c一旦按市场的思维方式处理，婚姻就成了追求利益最大化的工具。\u201d湖南工业大学伦理学专家陈科华教授认为。人们把利益最大化原则运用到社会生活各个领域，拆迁婚姻家庭就是为利益而组成，婚姻更像是一桩买卖。陈教授说，婚姻本来是为了幸福，但只有物质的婚姻，怎么会幸福？！拆迁婚姻本身就带有很强的功利性，且没有牢固的感情基础，要维持很难。国家三级心理咨询师周蜜也这样认为。在不少调查中，拆迁婚姻不幸福的，远远多过幸福的。缺乏牢固的感情基础，快速结婚随之而来的或许是快速离婚，甚至酿成悲剧。》》》有人说：没做伤天害理的事，就不需要被道德绑架也有不少人认为，不能一味的指责有\u201c拆迁结婚\u201d想法的人。在拆迁建设过程中，他们能够获得合适的补偿款，在地方发展的过程中分得一杯羹，这是他们的福气和运气，也是他们的正当权利。没做伤天害理的事，就不需要被道德绑架。有了更多的钱，自然能过上更好的日子。只要多沟通，多了解对方及家庭，学会宽容，拆迁婚姻也能幸福美满。网友评论：liqiang9012：50万不止，你找了老婆再怀一个孩子，孩子算2个的，分房子又有份的，100万至少。汤8汤8：有女孩子就等着嫁个拆迁户！找对象还是要合适最好，钱多钱少无所谓，过日子舒坦就行。zmm342132971：结婚一辈子的事，为了50万真没必要，还是选自己合适的最重要，这是花50万买不来的。FEDEX萧山：要知道前提是不离婚哦，今后要是离婚，对不起，这个50万有不少是要给跟你结婚的人，因为这个是她的名额，包括70平方的安置面积和她的人头费，祝幸福。晓酷：要是找个80岁的结婚，她带上5个儿子5个媳妇，5个孙子5个孙女\u2026\u2026那样就是20多个人头了，毛估估1000万到手了，可以少奋斗几十年了。女子相亲被拆迁户纠缠:对方穿鞋170 喜欢我哪我改这个春节，你被安排相亲了吗？据统计，浙江是相亲压力最大的省份。一年一度的催婚高峰，相亲找对象已如家常便饭般频繁。面对催婚，你的婚姻，你能做主吗？网友「狗蛋姑娘」在萧内网发帖吐槽：相亲遇到这么一家人，我也真的是醉了！好吧，实在是受不了了来吐槽一下，作为一名萧内潜水军，很少发帖子。今天来说一说我遇到的这一家人。我前几天刚过完22周岁生日，这一年来真的是被我妈各种逼着去相亲，自从我妈把要给我找对象的消息放出去以后，她的各路朋友都开始给我介绍。然后这次遇到的这个男的，是第一个要来跟我相亲的，我看了照片，真的无力吐槽，不想去，推了好几次。然后去看了另外几个男的，都没对上眼。本来想结束16年相亲之旅的，结果我妈竟然去给我看不上的那个男的当媒人了，给他介绍了一个女的。我妈之前也没有见过这个男的，不是很了解他们家情况，结果那天做了介绍以后，发现男方家和女方家条件相差太大了！男方家，拆迁户，家里2000多平方的房子拆掉，本来每年收租金都十几万可以收的那种，女方是单亲家庭，条件比较清贫的那种，然后我妈回来就说没了解清楚，早知道不给他们牵线了。。。"},{"title":"男子和妻子拌嘴赌气跳河 头浮在水上面表情冷静","category":"头条","author_name":"看看新闻","date":"2017-02-19 09:44","url":"http://mini.eastday.com/mobile/170219094412106.html","content":"（原标题：和老婆拌嘴赌气 老公竟直接跳河）根据天网监控画面显示，2月15号下午3点01分，在华阳通济桥桥中街位置，一名男子直接翻过护栏，纵身一跃，从距水面约10余米处跳入锦江，整个过程不足5秒钟。民警赶到现场后，在河中间发现男子，男子的头浮在水上面，表情比较冷静，在确定男子会水后，民警们稍微松了一口气，但营救依然刻不容缓。由于男子处在河道中央，且水流较急，不便于营救，华阳派出所和通济桥派出所的民警只能沿着河边一路小跑，跟随被水冲走的男子，一边大声对其呼喊讲话安抚，一边寻找最佳救援时机。民警一路追着男子小跑约2公里远，此时男子已被江水冲到南湖大桥附近。在派出所民警和消防官兵的协作下，该男子最终被营救上岸。经过对男子家属的问询，民警得知该男子姓丁，35岁，乐至县人，当时这名男子是在通济桥上，与他的妻子和他的小舅子在桥上走，但因为感情纠纷和经济方面的压力，这名男子一气之下，就从通济桥上跳了河里面去了。随后，丁某被送到天府新区人民医院，经检查，丁某生命特征平稳，很快就可以出院。"}]}
     */

    private String retCode;
    private String retInfo;
    private String sn;
    private DataEntity data;

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public String getRetInfo() {
        return retInfo;
    }

    public void setRetInfo(String retInfo) {
        this.retInfo = retInfo;
    }

    public String getSn() {
        return sn;
    }

    public void setSn(String sn) {
        this.sn = sn;
    }

    public DataEntity getData() {
        return data;
    }

    public void setData(DataEntity data) {
        this.data = data;
    }

    public static class DataEntity {
        /**
         * domain : news
         * news : [{"title":"小伙结婚能赚50万?父亲:要不今年不工作找对象吧","category":"头条","author_name":"杭州交通918","date":"2017-02-19 09:50","url":"http://mini.eastday.com/mobile/170219095010612.html","content":"说起拆迁，总是能让不少人兴奋。得知要拆迁，有一些家庭会通过闪婚，短时间内让家庭再添一员，以获得更多的补偿。萧山一小伙在论坛发帖说：老爸说，要是今年娶个老婆，相当于直接赚了50万。村里下半年拆迁的可能性极大，老爸说：\u201c你要是没对象赶紧找，光搬家人头费补贴就十几万，还能多分安置房，不要房换现金是50万。要不今年不用工作了，你的任务就是找对象，找到了就是赚钱了，少奋斗好几年！ \u201d想想确实是这么个道理，但可惜啊，人生不如意之事太多，虽然年纪不小了，相亲了几次也就敷衍一下，都没成。一个人多自由啊，早睡早起，吃好喝好，无牵无挂。弱弱的问一句，现在速战速决，还是等以后再解决？毕竟穷人家的孩子，可能会听父母多一点吧，这就是现实。虽然这也不是什么新鲜事，只不过自己遇到了这种事，才知道选择其实不容易。这年头赚钱不容易，找个心爱的人更不容易，只能说不强求，两全其美的事万一真发生了也是开心的。我相信，还有很多跟我一样处境的小伙伴，一旦选择了，就不要再遗憾。在该论坛里随便搜搜，类似情况的帖子很多，甚至有网友为了补偿结婚离婚了三次。但如愿得了人头费、安置房之后，婚姻会幸福吗？》》》拆迁结婚到底该不该？有人说：这种婚姻像买卖\u201c一旦按市场的思维方式处理，婚姻就成了追求利益最大化的工具。\u201d湖南工业大学伦理学专家陈科华教授认为。人们把利益最大化原则运用到社会生活各个领域，拆迁婚姻家庭就是为利益而组成，婚姻更像是一桩买卖。陈教授说，婚姻本来是为了幸福，但只有物质的婚姻，怎么会幸福？！拆迁婚姻本身就带有很强的功利性，且没有牢固的感情基础，要维持很难。国家三级心理咨询师周蜜也这样认为。在不少调查中，拆迁婚姻不幸福的，远远多过幸福的。缺乏牢固的感情基础，快速结婚随之而来的或许是快速离婚，甚至酿成悲剧。》》》有人说：没做伤天害理的事，就不需要被道德绑架也有不少人认为，不能一味的指责有\u201c拆迁结婚\u201d想法的人。在拆迁建设过程中，他们能够获得合适的补偿款，在地方发展的过程中分得一杯羹，这是他们的福气和运气，也是他们的正当权利。没做伤天害理的事，就不需要被道德绑架。有了更多的钱，自然能过上更好的日子。只要多沟通，多了解对方及家庭，学会宽容，拆迁婚姻也能幸福美满。网友评论：liqiang9012：50万不止，你找了老婆再怀一个孩子，孩子算2个的，分房子又有份的，100万至少。汤8汤8：有女孩子就等着嫁个拆迁户！找对象还是要合适最好，钱多钱少无所谓，过日子舒坦就行。zmm342132971：结婚一辈子的事，为了50万真没必要，还是选自己合适的最重要，这是花50万买不来的。FEDEX萧山：要知道前提是不离婚哦，今后要是离婚，对不起，这个50万有不少是要给跟你结婚的人，因为这个是她的名额，包括70平方的安置面积和她的人头费，祝幸福。晓酷：要是找个80岁的结婚，她带上5个儿子5个媳妇，5个孙子5个孙女\u2026\u2026那样就是20多个人头了，毛估估1000万到手了，可以少奋斗几十年了。女子相亲被拆迁户纠缠:对方穿鞋170 喜欢我哪我改这个春节，你被安排相亲了吗？据统计，浙江是相亲压力最大的省份。一年一度的催婚高峰，相亲找对象已如家常便饭般频繁。面对催婚，你的婚姻，你能做主吗？网友「狗蛋姑娘」在萧内网发帖吐槽：相亲遇到这么一家人，我也真的是醉了！好吧，实在是受不了了来吐槽一下，作为一名萧内潜水军，很少发帖子。今天来说一说我遇到的这一家人。我前几天刚过完22周岁生日，这一年来真的是被我妈各种逼着去相亲，自从我妈把要给我找对象的消息放出去以后，她的各路朋友都开始给我介绍。然后这次遇到的这个男的，是第一个要来跟我相亲的，我看了照片，真的无力吐槽，不想去，推了好几次。然后去看了另外几个男的，都没对上眼。本来想结束16年相亲之旅的，结果我妈竟然去给我看不上的那个男的当媒人了，给他介绍了一个女的。我妈之前也没有见过这个男的，不是很了解他们家情况，结果那天做了介绍以后，发现男方家和女方家条件相差太大了！男方家，拆迁户，家里2000多平方的房子拆掉，本来每年收租金都十几万可以收的那种，女方是单亲家庭，条件比较清贫的那种，然后我妈回来就说没了解清楚，早知道不给他们牵线了。。。"},{"title":"男子和妻子拌嘴赌气跳河 头浮在水上面表情冷静","category":"头条","author_name":"看看新闻","date":"2017-02-19 09:44","url":"http://mini.eastday.com/mobile/170219094412106.html","content":"（原标题：和老婆拌嘴赌气 老公竟直接跳河）根据天网监控画面显示，2月15号下午3点01分，在华阳通济桥桥中街位置，一名男子直接翻过护栏，纵身一跃，从距水面约10余米处跳入锦江，整个过程不足5秒钟。民警赶到现场后，在河中间发现男子，男子的头浮在水上面，表情比较冷静，在确定男子会水后，民警们稍微松了一口气，但营救依然刻不容缓。由于男子处在河道中央，且水流较急，不便于营救，华阳派出所和通济桥派出所的民警只能沿着河边一路小跑，跟随被水冲走的男子，一边大声对其呼喊讲话安抚，一边寻找最佳救援时机。民警一路追着男子小跑约2公里远，此时男子已被江水冲到南湖大桥附近。在派出所民警和消防官兵的协作下，该男子最终被营救上岸。经过对男子家属的问询，民警得知该男子姓丁，35岁，乐至县人，当时这名男子是在通济桥上，与他的妻子和他的小舅子在桥上走，但因为感情纠纷和经济方面的压力，这名男子一气之下，就从通济桥上跳了河里面去了。随后，丁某被送到天府新区人民医院，经检查，丁某生命特征平稳，很快就可以出院。"}]
         */

        private String domain;
        private List<NewsEntity> news;

        public String getDomain() {
            return domain;
        }

        public void setDomain(String domain) {
            this.domain = domain;
        }

        public List<NewsEntity> getNews() {
            return news;
        }

        public void setNews(List<NewsEntity> news) {
            this.news = news;
        }

        public static class NewsEntity {
            /**
             * title : 小伙结婚能赚50万?父亲:要不今年不工作找对象吧
             * category : 头条
             * author_name : 杭州交通918
             * date : 2017-02-19 09:50
             * url : http://mini.eastday.com/mobile/170219095010612.html
             * content : 说起拆迁，总是能让不少人兴奋。得知要拆迁，有一些家庭会通过闪婚，短时间内让家庭再添一员，以获得更多的补偿。萧山一小伙在论坛发帖说：老爸说，要是今年娶个老婆，相当于直接赚了50万。村里下半年拆迁的可能性极大，老爸说：“你要是没对象赶紧找，光搬家人头费补贴就十几万，还能多分安置房，不要房换现金是50万。要不今年不用工作了，你的任务就是找对象，找到了就是赚钱了，少奋斗好几年！ ”想想确实是这么个道理，但可惜啊，人生不如意之事太多，虽然年纪不小了，相亲了几次也就敷衍一下，都没成。一个人多自由啊，早睡早起，吃好喝好，无牵无挂。弱弱的问一句，现在速战速决，还是等以后再解决？毕竟穷人家的孩子，可能会听父母多一点吧，这就是现实。虽然这也不是什么新鲜事，只不过自己遇到了这种事，才知道选择其实不容易。这年头赚钱不容易，找个心爱的人更不容易，只能说不强求，两全其美的事万一真发生了也是开心的。我相信，还有很多跟我一样处境的小伙伴，一旦选择了，就不要再遗憾。在该论坛里随便搜搜，类似情况的帖子很多，甚至有网友为了补偿结婚离婚了三次。但如愿得了人头费、安置房之后，婚姻会幸福吗？》》》拆迁结婚到底该不该？有人说：这种婚姻像买卖“一旦按市场的思维方式处理，婚姻就成了追求利益最大化的工具。”湖南工业大学伦理学专家陈科华教授认为。人们把利益最大化原则运用到社会生活各个领域，拆迁婚姻家庭就是为利益而组成，婚姻更像是一桩买卖。陈教授说，婚姻本来是为了幸福，但只有物质的婚姻，怎么会幸福？！拆迁婚姻本身就带有很强的功利性，且没有牢固的感情基础，要维持很难。国家三级心理咨询师周蜜也这样认为。在不少调查中，拆迁婚姻不幸福的，远远多过幸福的。缺乏牢固的感情基础，快速结婚随之而来的或许是快速离婚，甚至酿成悲剧。》》》有人说：没做伤天害理的事，就不需要被道德绑架也有不少人认为，不能一味的指责有“拆迁结婚”想法的人。在拆迁建设过程中，他们能够获得合适的补偿款，在地方发展的过程中分得一杯羹，这是他们的福气和运气，也是他们的正当权利。没做伤天害理的事，就不需要被道德绑架。有了更多的钱，自然能过上更好的日子。只要多沟通，多了解对方及家庭，学会宽容，拆迁婚姻也能幸福美满。网友评论：liqiang9012：50万不止，你找了老婆再怀一个孩子，孩子算2个的，分房子又有份的，100万至少。汤8汤8：有女孩子就等着嫁个拆迁户！找对象还是要合适最好，钱多钱少无所谓，过日子舒坦就行。zmm342132971：结婚一辈子的事，为了50万真没必要，还是选自己合适的最重要，这是花50万买不来的。FEDEX萧山：要知道前提是不离婚哦，今后要是离婚，对不起，这个50万有不少是要给跟你结婚的人，因为这个是她的名额，包括70平方的安置面积和她的人头费，祝幸福。晓酷：要是找个80岁的结婚，她带上5个儿子5个媳妇，5个孙子5个孙女……那样就是20多个人头了，毛估估1000万到手了，可以少奋斗几十年了。女子相亲被拆迁户纠缠:对方穿鞋170 喜欢我哪我改这个春节，你被安排相亲了吗？据统计，浙江是相亲压力最大的省份。一年一度的催婚高峰，相亲找对象已如家常便饭般频繁。面对催婚，你的婚姻，你能做主吗？网友「狗蛋姑娘」在萧内网发帖吐槽：相亲遇到这么一家人，我也真的是醉了！好吧，实在是受不了了来吐槽一下，作为一名萧内潜水军，很少发帖子。今天来说一说我遇到的这一家人。我前几天刚过完22周岁生日，这一年来真的是被我妈各种逼着去相亲，自从我妈把要给我找对象的消息放出去以后，她的各路朋友都开始给我介绍。然后这次遇到的这个男的，是第一个要来跟我相亲的，我看了照片，真的无力吐槽，不想去，推了好几次。然后去看了另外几个男的，都没对上眼。本来想结束16年相亲之旅的，结果我妈竟然去给我看不上的那个男的当媒人了，给他介绍了一个女的。我妈之前也没有见过这个男的，不是很了解他们家情况，结果那天做了介绍以后，发现男方家和女方家条件相差太大了！男方家，拆迁户，家里2000多平方的房子拆掉，本来每年收租金都十几万可以收的那种，女方是单亲家庭，条件比较清贫的那种，然后我妈回来就说没了解清楚，早知道不给他们牵线了。。。
             */

            private String title;
            private String category;
            private String author_name;
            private String date;
            private String url;
            private String content;

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getCategory() {
                return category;
            }

            public void setCategory(String category) {
                this.category = category;
            }

            public String getAuthor_name() {
                return author_name;
            }

            public void setAuthor_name(String author_name) {
                this.author_name = author_name;
            }

            public String getDate() {
                return date;
            }

            public void setDate(String date) {
                this.date = date;
            }

            public String getUrl() {
                return url;
            }

            public void setUrl(String url) {
                this.url = url;
            }

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }
        }
    }
}
